# Project Title
### Data Engineering Capstone Project

#### Project Summary
--describe your project at a high level--

The project follows the follow steps:
* Step 1: Scope the Project and Gather Data
* Step 2: Explore and Assess the Data
* Step 3: Define the Data Model
* Step 4: Run ETL to Model the Data
* Step 5: Complete Project Write Up

In [1]:
# Do all imports and installs here
import pandas as pd
import psycopg2
from pyspark.sql import SparkSession
from insert_data import insert_fact, insert_dim_imm_per, insert_dim_imm_air, insert_dim_demo_info, insert_dim_demo_stat, insert_dim_temp

### Step 1: Scope the Project and Gather Data

#### Scope 

The purpose of this project is to see the connection between the temperature of the cities that people immigrate to. We could check the preferred destination cities for immigrants based on the immigration year as well. There will be 1 fact table with 5 dimension tables processed from the datasets below. This data model will be used for a further data analysis using SQL in order to see the relationship as I mentioned previously.

__Data Used:__
- I94 Immigration Data
- Temperature Data
- Demographics Data

__Tools Used:__
- AWS
    - Redshift
- Python
    - PySpark
- SQL

#### I94 Immigration Data
This data comes from [National Travel and Trourism Office(NTTO)](https://www.trade.gov/national-travel-and-tourism-office). The subject of the data is the immigrants going to the U.S. and the information is gives are where they come from, birth year, gender, visa type, etc.

In [2]:
# Read in the data here
fname = '../../data/18-83510-I94-Data-2016/i94_apr16_sub.sas7bdat'
df = pd.read_sas(fname, 'sas7bdat', encoding="ISO-8859-1")

In [3]:
df.head()

,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,...,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,6.0,2016.0,4.0,692.0,692.0,XXX,20573.0,NaN,NaN,NaN,...,U,NaN,1979.0,10282016,NaN,NaN,NaN,1.897628e+09,NaN,B2
1,7.0,2016.0,4.0,254.0,276.0,ATL,20551.0,1.0,AL,NaN,...,Y,NaN,1991.0,D/S,M,NaN,NaN,3.736796e+09,00296,F1
2,15.0,2016.0,4.0,101.0,101.0,WAS,20545.0,1.0,MI,20691.0,...,NaN,M,1961.0,09302016,M,NaN,OS,6.666432e+08,93,B2
3,16.0,2016.0,4.0,101.0,101.0,NYC,20545.0,1.0,MA,20567.0,...,NaN,M,1988.0,09302016,NaN,NaN,AA,9.246846e+10,00199,B2
4,17.0,2016.0,4.0,101.0,101.0,NYC,20545.0,1.0,MA,20567.0,...,NaN,M,2012.0,09302016,NaN,NaN,AA,9.246846e+10,00199,B2

In [4]:
df.columns

Index(['cicid', 'i94yr', 'i94mon', 'i94cit', 'i94res', 'i94port', 'arrdate',
       'i94mode', 'i94addr', 'depdate', 'i94bir', 'i94visa', 'count',
       'dtadfile', 'visapost', 'occup', 'entdepa', 'entdepd', 'entdepu',
       'matflag', 'biryear', 'dtaddto', 'gender', 'insnum', 'airline',
       'admnum', 'fltno', 'visatype'],
      dtype='object')

In [181]:
fact_immigration = df[['cicid', 'i94yr', 'i94mon', 'i94port', 'arrdate', 'depdate', 'i94mode', 'i94visa']]
fact_immigration.columns = ['cic_id', 'year', 'month', 'dep_city', 'arrival_date', 'dep_date', 'travel_code', 'visa']
fact_immigration['country'] = 'United States'
fact_immigration.head()

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

,cic_id,year,month,dep_city,arrival_date,dep_date,travel_code,visa,country
0,6.0,2016.0,4.0,XXX,20573.0,NaN,NaN,2.0,United States
1,7.0,2016.0,4.0,ATL,20551.0,NaN,1.0,3.0,United States
2,15.0,2016.0,4.0,WAS,20545.0,20691.0,1.0,2.0,United States
3,16.0,2016.0,4.0,NYC,20545.0,20567.0,1.0,2.0,United States
4,17.0,2016.0,4.0,NYC,20545.0,20567.0,1.0,2.0,United States

In [182]:
dim_immigration_personal = df[['cicid', 'i94cit', 'i94res', 'biryear', 'gender', 'insnum']]
dim_immigration_personal.columns = ['cic_id', 'citizen_country', 'resident_country', 'birthyear', 'gender', 'ins_number']
dim_immigration_personal.head()

   cic_id  citizen_country  resident_country  birthyear gender ins_number
0     6.0            692.0             692.0     1979.0    NaN        NaN
1     7.0            254.0             276.0     1991.0      M        NaN
2    15.0            101.0             101.0     1961.0      M        NaN
3    16.0            101.0             101.0     1988.0    NaN        NaN
4    17.0            101.0             101.0     2012.0    NaN        NaN

In [183]:
dim_immigration_air = df[['cicid', 'airline', 'admnum', 'fltno', 'i94visa', 'visatype']]
dim_immigration_air.columns = ['cic_id', 'airline', 'admin_number', 'flight_number', 'visa', 'visa_type']
dim_immigration_air.head()

   cic_id airline  admin_number flight_number  visa visa_type
0     6.0     NaN  1.897628e+09           NaN   2.0        B2
1     7.0     NaN  3.736796e+09         00296   3.0        F1
2    15.0      OS  6.666432e+08            93   2.0        B2
3    16.0      AA  9.246846e+10         00199   2.0        B2
4    17.0      AA  9.246846e+10         00199   2.0        B2

In [8]:
from pyspark.sql import SparkSession

spark = SparkSession.builder.\
config("spark.jars.repositories", "https://repos.spark-packages.org/").\
config("spark.jars.packages", "saurfang:spark-sas7bdat:2.0.0-s_2.11").\
enableHiveSupport().getOrCreate()

df_spark = spark.read.format('com.github.saurfang.sas.spark').load('../../data/18-83510-I94-Data-2016/i94_apr16_sub.sas7bdat')

In [6]:
#write to parquet
df_spark.write.parquet("sas_data")
df_spark=spark.read.parquet("sas_data")

AnalysisException: 'path file:/home/workspace/sas_data already exists.;'

#### Temperature Data
This data comes from [Kaggle](https://www.kaggle.com/berkeleyearth/climate-change-earth-surface-temperature-data), and it shows the temperature in different cities around the world. It's recorded monthly, and the values are the average temperature of that month.

In [8]:
fname = '../../data2/GlobalLandTemperaturesByCity.csv'
df_temp = pd.read_csv(fname)

In [9]:
df_temp.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Ã…rhus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Ã…rhus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Ã…rhus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Ã…rhus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Ã…rhus,Denmark,57.05N,10.33E

In [184]:
df_temp_us = df_temp[df_temp['Country'] == 'United States']
df_temp_us.columns = ['dt', 'avg_temp', 'avg_temp_uncertainty', 'city', 'country', 'latitude', 'longitude']
df_temp_us.head()

,dt,avg_temp,avg_temp_uncertainty,city,country,latitude,longitude
47555,1820-01-01,2.101,3.217,Abilene,United States,32.95N,100.53W
47556,1820-02-01,6.926,2.853,Abilene,United States,32.95N,100.53W
47557,1820-03-01,10.767,2.395,Abilene,United States,32.95N,100.53W
47558,1820-04-01,17.989,2.202,Abilene,United States,32.95N,100.53W
47559,1820-05-01,21.809,2.036,Abilene,United States,32.95N,100.53W

In [185]:
df_temp_us['dt'] = pd.to_datetime(df_temp_us['dt'])
df_temp_us['month'] = pd.DatetimeIndex(df_temp_us['dt']).month
df_temp_us['year'] = pd.DatetimeIndex(df_temp_us['dt']).year
df_temp_us.head()

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

,dt,avg_temp,avg_temp_uncertainty,city,country,latitude,longitude,month,year
47555,1820-01-01,2.101,3.217,Abilene,United States,32.95N,100.53W,1,1820
47556,1820-02-01,6.926,2.853,Abilene,United States,32.95N,100.53W,2,1820
47557,1820-03-01,10.767,2.395,Abilene,United States,32.95N,100.53W,3,1820
47558,1820-04-01,17.989,2.202,Abilene,United States,32.95N,100.53W,4,1820
47559,1820-05-01,21.809,2.036,Abilene,United States,32.95N,100.53W,5,1820

#### US Cities Demographics Data
This data comes from [OpenSoft](https://public.opendatasoft.com/explore/dataset/us-cities-demographics/export/), and it shows the demographics of the cities in the U.S. including the population, median age, the state the city belongs to, etc.

In [186]:
fname = './us-cities-demographics.csv'
df_demo = pd.read_csv(fname, delimiter=';')

In [187]:
df_demo.head()

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,Silver Spring,Maryland,33.8,40601.0,41862.0,82463,1562.0,30908.0,2.60,MD,Hispanic or Latino,25924
1,Quincy,Massachusetts,41.0,44129.0,49500.0,93629,4147.0,32935.0,2.39,MA,White,58723
2,Hoover,Alabama,38.5,38040.0,46799.0,84839,4819.0,8229.0,2.58,AL,Asian,4759
3,Rancho Cucamonga,California,34.5,88127.0,87105.0,175232,5821.0,33878.0,3.18,CA,Black or African-American,24437
4,Newark,New Jersey,34.6,138040.0,143873.0,281913,5829.0,86253.0,2.73,NJ,White,76402

In [188]:
df_demo_info = df_demo[['City', 'State', 'Male Population', 'Female Population', 'Total Population', 'Number of Veterans', 'Foreign-born', 'State Code', 'Race']]
df_demo_info.columns = ['city', 'state', 'm_population', 'f_population', 'total_population', 'num_of_veterans', 'foreign_born', 'state_code', 'race']
df_demo_info.head()

,city,state,m_population,f_population,total_population,num_of_veterans,foreign_born,state_code,race
0,Silver Spring,Maryland,40601.0,41862.0,82463,1562.0,30908.0,MD,Hispanic or Latino
1,Quincy,Massachusetts,44129.0,49500.0,93629,4147.0,32935.0,MA,White
2,Hoover,Alabama,38040.0,46799.0,84839,4819.0,8229.0,AL,Asian
3,Rancho Cucamonga,California,88127.0,87105.0,175232,5821.0,33878.0,CA,Black or African-American
4,Newark,New Jersey,138040.0,143873.0,281913,5829.0,86253.0,NJ,White

In [189]:
df_demo_stat = df_demo[['City', 'State', 'Median Age', 'Average Household Size', 'State Code']]
df_demo_stat.columns = ['city', 'state', 'median_age', 'avg_household_size', 'state_code']
df_demo_stat.head()

               city          state  median_age  avg_household_size state_code
0     Silver Spring       Maryland        33.8                2.60         MD
1            Quincy  Massachusetts        41.0                2.39         MA
2            Hoover        Alabama        38.5                2.58         AL
3  Rancho Cucamonga     California        34.5                3.18         CA
4            Newark     New Jersey        34.6                2.73         NJ

### Step 2: Explore and Assess the Data
#### Explore the Data 
Identify data quality issues, like missing values, duplicate data, etc.

#### Cleaning Steps
Document steps necessary to clean the data

In [190]:
fact_immigration.dtypes

cic_id          float64
year            float64
month           float64
dep_city         object
arrival_date    float64
dep_date        float64
travel_code     float64
visa            float64
country          object
dtype: object

#### Converting floats into datetime format for fact_immigration table

In [191]:
fact_immigration['arrival_date'] = pd.to_datetime(fact_immigration['arrival_date'], unit='D',
               origin=pd.Timestamp('1960-01-01'))
fact_immigration['dep_date'] = pd.to_datetime(fact_immigration['dep_date'], unit='D',
               origin=pd.Timestamp('1960-01-01'))
fact_immigration.head()

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.

,cic_id,year,month,dep_city,arrival_date,dep_date,travel_code,visa,country
0,6.0,2016.0,4.0,XXX,2016-04-29,NaT,NaN,2.0,United States
1,7.0,2016.0,4.0,ATL,2016-04-07,NaT,1.0,3.0,United States
2,15.0,2016.0,4.0,WAS,2016-04-01,2016-08-25,1.0,2.0,United States
3,16.0,2016.0,4.0,NYC,2016-04-01,2016-04-23,1.0,2.0,United States
4,17.0,2016.0,4.0,NYC,2016-04-01,2016-04-23,1.0,2.0,United States

In [192]:
fact_immigration = fact_immigration[pd.notnull(fact_immigration['arrival_date'])]
fact_immigration = fact_immigration[pd.notnull(fact_immigration['dep_date'])]

#### Dropping the non-integer rows in flight_number column in the dim_immigration_air table

In [193]:
dim_immigration_air.dtypes

cic_id           float64
airline           object
admin_number     float64
flight_number     object
visa             float64
visa_type         object
dtype: object

In [194]:
dim_immigration_air.where(dim_immigration_air['flight_number'] == 'LAND')

            cic_id airline  admin_number flight_number  visa visa_type
0              NaN     NaN           NaN           NaN   NaN       NaN
1              NaN     NaN           NaN           NaN   NaN       NaN
2              NaN     NaN           NaN           NaN   NaN       NaN
3              NaN     NaN           NaN           NaN   NaN       NaN
4              NaN     NaN           NaN           NaN   NaN       NaN
5              NaN     NaN           NaN           NaN   NaN       NaN
6              NaN     NaN           NaN           NaN   NaN       NaN
7              NaN     NaN           NaN           NaN   NaN       NaN
8              NaN     NaN           NaN           NaN   NaN       NaN
9              NaN     NaN           NaN           NaN   NaN       NaN
10             NaN     NaN           NaN           NaN   NaN       NaN
11             NaN     NaN           NaN           NaN   NaN       NaN
12             NaN     NaN           NaN           NaN   NaN       NaN
13             NaN     NaN           NaN           NaN   NaN       NaN
14             NaN     NaN           NaN           NaN   NaN       NaN
15             NaN     NaN           NaN           NaN   NaN       NaN
16             NaN     NaN           NaN           NaN   NaN       NaN
17             NaN     NaN           NaN           NaN   NaN       NaN
18             NaN     NaN           NaN           NaN   NaN       NaN
19             NaN     NaN           NaN           NaN   NaN       NaN
20             NaN     NaN           NaN           NaN   NaN       NaN
21             NaN     NaN           NaN           NaN   NaN       NaN
22             NaN     NaN           NaN           NaN   NaN       NaN
23             NaN     NaN           NaN           NaN   NaN       NaN
24             NaN     NaN           NaN           NaN   NaN       NaN
25             NaN     NaN           NaN           NaN   NaN       NaN
26             NaN     NaN           NaN           NaN   NaN       NaN
27             NaN     NaN           NaN           NaN   NaN       NaN
28             NaN     NaN           NaN           NaN   NaN       NaN
29             NaN     NaN           NaN           NaN   NaN       NaN
...            ...     ...           ...           ...   ...       ...
3096283  5200122.0     NaN  9.466694e+10          LAND   2.0        B2
3096284  5200121.0     NaN  9.466708e+10          LAND   2.0        B2
3096285        NaN     NaN           NaN           NaN   NaN       NaN
3096286        NaN     NaN           NaN           NaN   NaN       NaN
3096287  2303672.0     NaN  7.870831e+08          LAND   1.0        B1
3096288   625288.0     NaN  9.266689e+10          LAND   1.0        B1
3096289  2873230.0     NaN  8.806588e+10          LAND   2.0        B2
3096290  2873231.0     NaN  8.806625e+10          LAND   2.0        B2
3096291  2873232.0     NaN  8.806640e+10          LAND   2.0        B2
3096292        NaN     NaN           NaN           NaN   NaN       NaN
3096293        NaN     NaN           NaN           NaN   NaN       NaN
3096294   218224.0     NaN  9.251075e+10          LAND   2.0        B2
3096295  2873233.0     NaN  9.356363e+10          LAND   2.0        B2
3096296  2873234.0     NaN  9.356366e+10          LAND   2.0        B2
3096297  3298796.0     NaN  9.379549e+10          LAND   1.0        B1
3096298  4249463.0     NaN  9.428408e+10          LAND   1.0        B1
3096299  1153287.0     NaN  6.878366e+08          LAND   2.0        B2
3096300  1153288.0     NaN  6.880218e+08          LAND   2.0        B2
3096301        NaN     NaN           NaN           NaN   NaN       NaN
3096302  4471818.0     NaN  9.429612e+10          LAND   2.0        B2
3096303  4471817.0     NaN  9.429629e+10          LAND   2.0        B2
3096304  4471819.0     NaN  9.429643e+10          LAND   2.0        B2
3096305        NaN     NaN           NaN           NaN   NaN       NaN
3096306  4249464.0     NaN  9.426909e+10          LAND   1.0        B1
3096307  5416391.0     NaN  9.471480e+10          LAND   1.0        B1
3096308        NaN     NaN           NaN           NaN   NaN       NaN
3096309        NaN     NaN           NaN           NaN   NaN       NaN
3096310        NaN     NaN           NaN           NaN   NaN       NaN
3096311  5658953.0     NaN  9.488710e+10          LAND   2.0        B2
3096312        NaN     NaN           NaN           NaN   NaN       NaN

[3096313 rows x 6 columns]

In [195]:
dim_immigration_air.iloc[540]

cic_id                   610
airline                  *GA
admin_number     9.24611e+10
flight_number          VPCSW
visa                       2
visa_type                 B2
Name: 540, dtype: object

In [196]:
dim_immigration_air['flight_number'] = dim_immigration_air[dim_immigration_air['flight_number'].apply(lambda x: str(x).isdigit())]

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [197]:
dim_immigration_air['flight_number'] = pd.to_numeric(dim_immigration_air['flight_number'])

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [198]:
dim_immigration_air.dtypes

cic_id           float64
airline           object
admin_number     float64
flight_number    float64
visa             float64
visa_type         object
dtype: object

#### Extracting necessary information from i94 description file

In [199]:
with open("I94_SAS_Labels_Descriptions.SAS") as f:
    contents = f.readlines()

In [200]:
countries = contents[9:298]
ports = contents[302:962]
modes = contents[972:976]
states = contents[981:1036]
visa = contents[1046:1049]

In [201]:
country = [x.strip().split('=') for x in countries]
country_code = [x[0].replace("'","") for x in country]
country_name = [x[1].replace("'","") for x in country]
df_country = pd.DataFrame({'country_code':country_code, 'country_name':country_name})
df_country.head()

  country_code                                       country_name
0         582     MEXICO Air Sea, and Not Reported (I-94, no l...
1         236                                         AFGHANISTAN
2         101                                             ALBANIA
3         316                                             ALGERIA
4         102                                             ANDORRA

In [202]:
port = [x.strip().split('=') for x in ports]
port_code = [x[0].replace("'","").strip('\t') for x in port]
port_loc = [x[1].replace("'","").strip('\t') for x in port]
port_loc_c = [x.split(',')[0] for x in port_loc]
port_loc_s = [x.split(',')[-1] for x in port_loc]
df_port = pd.DataFrame({'port_code':port_code, 'port_loc_city':port_loc_c, 'port_loc_state':port_loc_s})
df_port.head()

  port_code             port_loc_city    port_loc_state
0       ALC                     ALCAN   AK
1       ANC                 ANCHORAGE       AK
2       BAR  BAKER AAF - BAKER ISLAND                AK
3       DAC             DALTONS CACHE           AK
4       PIZ    DEW STATION PT LAY DEW                AK

In [203]:
mode = [x.strip().split('=') for x in modes]
code = [x[0] for x in mode]
mode_name = [x[1].replace("'", "").strip(";") for x in mode]
df_mode = pd.DataFrame({'code':code, 'mode':mode_name})
df_mode.head()

  code            mode
0   1              Air
1   2              Sea
2   3             Land
3   9    Not reported

In [204]:
state = [x.strip().split('=') for x in states]
code = [x[0].replace("'", "") for x in state]
state_name = [x[1].replace("'", "") for x in state]
df_state = pd.DataFrame({'state_code':code, 'state':state_name})
df_state.head()

  state_code       state
0         AL     ALABAMA
1         AK      ALASKA
2         AZ     ARIZONA
3         AR    ARKANSAS
4         CA  CALIFORNIA

In [205]:
visa_list = [x.strip().split('=') for x in visa]
code = [x[0] for x in visa_list]
visa_name = [x[1] for x in visa_list]
df_visa = pd.DataFrame({'code':code, 'visa':visa_name})
df_visa.head()

  code       visa
0   1    Business
1   2    Pleasure
2   3     Student

In [206]:
df_demo_info.duplicated(subset=['city']).sum()

2324

In [207]:
df_demo_stat.duplicated(subset=['city']).sum()

2324

In [208]:
(~df_demo_info.duplicated()).sum()

2891

In [209]:
(~df_demo_stat.duplicated()).sum()

596

In [210]:
df_demo_info.loc[df_demo_info.duplicated(subset=['city'],keep=False), :]

,city,state,m_population,f_population,total_population,num_of_veterans,foreign_born,state_code,race
0,Silver Spring,Maryland,40601.0,41862.0,82463,1562.0,30908.0,MD,Hispanic or Latino
1,Quincy,Massachusetts,44129.0,49500.0,93629,4147.0,32935.0,MA,White
2,Hoover,Alabama,38040.0,46799.0,84839,4819.0,8229.0,AL,Asian
3,Rancho Cucamonga,California,88127.0,87105.0,175232,5821.0,33878.0,CA,Black or African-American
4,Newark,New Jersey,138040.0,143873.0,281913,5829.0,86253.0,NJ,White
5,Peoria,Illinois,56229.0,62432.0,118661,6634.0,7517.0,IL,American Indian and Alaska Native
6,Avondale,Arizona,38712.0,41971.0,80683,4815.0,8355.0,AZ,Black or African-American
7,West Covina,California,51629.0,56860.0,108489,3800.0,37038.0,CA,Asian
8,O'Fallon,Missouri,41762.0,43270.0,85032,5783.0,3269.0,MO,Hispanic or Latino
9,High Point,North Carolina,51751.0,58077.0,109828,5204.0,16315.0,NC,Asian
10,Folsom,California,41051.0,35317.0,76368,4187.0,13234.0,CA,Hispanic or Latino
11,Folsom,California,41051.0,35317.0,76368,4187.0,13234.0,CA,American Indian and Alaska Native
12,Philadelphia,Pennsylvania,741270.0,826172.0,1567442,61995.0,205339.0,PA,Asian
13,Wichita,Kansas,192354.0,197601.0,389955,23978.0,40270.0,KS,Hispanic or Latino
14,Wichita,Kansas,192354.0,197601.0,389955,23978.0,40270.0,KS,American Indian and Alaska Native
15,Fort Myers,Florida,36850.0,37165.0,74015,4312.0,15365.0,FL,White
16,Pittsburgh,Pennsylvania,149690.0,154695.0,304385,17728.0,28187.0,PA,White
17,Laredo,Texas,124305.0,131484.0,255789,4921.0,68427.0,TX,American Indian and Alaska Native
18,Berkeley,California,60142.0,60829.0,120971,3736.0,25000.0,CA,Asian
19,Santa Clara,California,63278.0,62938.0,126216,4426.0,52281.0,CA,White
20,Allen,Pennsylvania,60626.0,59581.0,120207,5691.0,19652.0,PA,Black or African-American
21,Hampton,Virginia,66214.0,70240.0,136454,19638.0,6204.0,VA,Black or African-American
22,Bolingbrook,Illinois,36295.0,35801.0,72096,2951.0,15212.0,IL,American Indian and Alaska Native
23,Frederick,Maryland,33146.0,36336.0,69482,3870.0,14211.0,MD,White
24,Sparks,Nevada,47780.0,48318.0,96098,7315.0,15690.0,NV,Hispanic or Latino
25,Rancho Cordova,California,34844.0,36182.0,71026,4590.0,17020.0,CA,Asian
26,Westminster,Colorado,54866.0,58251.0,113117,6512.0,11361.0,CO,Hispanic or Latino
27,Lakewood,Colorado,76013.0,76576.0,152589,9988.0,14169.0,CO,Hispanic or Latino
28,Flint,Michigan,48984.0,49313.0,98297,3757.0,2138.0,MI,White
29,New Haven,Connecticut,63765.0,66545.0,130310,2567.0,25871.0,CT,American Indian and Alaska Native
...,...,...,...,...,...,...,...,...,...
2861,Scranton,Pennsylvania,37975.0,39137.0,77112,5059.0,8069.0,PA,Asian
2862,Aurora,Colorado,177899.0,180971.0,358870,25158.0,65816.0,CO,Asian
2863,Redlands,California,33993.0,37035.0,71028,3445.0,8681.0,CA,Hispanic or Latino
2864,Alhambra,California,42184.0,43388.0,85572,1673.0,44441.0,CA,Hispanic or Latino
2865,Alhambra,California,42184.0,43388.0,85572,1673.0,44441.0,CA,Black or African-American
2866,Rio Rancho,New Mexico,47251.0,46904.0,94155,8527.0,5200.0,NM,Black or African-American
2867,Wyoming,Michigan,35967.0,39310.0,75277,3447.0,8612.0,MI,American Indian and Alaska Native
2868,Reading,Pennsylvania,43668.0,44205.0,87873,2580.0,17043.0,PA,Asian
2869,Rialto,California,49902.0,53235.0,103137,2036.0,32741.0,CA,American Indian and Alaska Native
2870,Tallahassee,Florida,89390.0,100504.0,189894,9575.0,16720.0,FL,Asian
2871,Hemet,California,38622.0,45251.0,83873,5613.0,13330.0,CA,Asian
2872,Aurora,Illinois,101964.0,101751.0,203715,4988.0,50980.0,IL,Black or African-American
2873,Carmel,Indiana,42928.0,46101.0,89029,2723.0,9645.0,IN,White
2874,Glendale,California,98181.0,102844.0,201025,4448.0,111510.0,CA,Hispanic or Latino
2875,Des Moines,Iowa,103726.0,106591.0,210317,11780.0,23857.0,IA,White
2876,College Station,Texas,54125.0,53774.0,107899,2471.0,16145.0,TX,White
2877,Peoria,Arizona,80139.0,91103.0,171242,13019.0,14260.0,AZ,Asian
2878,Charlotte,North Carolina,396646.0,430475.0,827121,36046.0,128897.0,NC,American Indian and Alaska Native
2879,Lafayette,Indiana,34313.0,36857.0,71170,5045.0,5697.0,IN,Hispanic or Latino
2880,Abilene,Texas,65212.0,60664.0,125876,9367.0,8129.0,TX,Black or African-American
2881,Gulfport,Mississippi,33108.0,38764.0,71872,6646.0,3072.0,MS,White
2882,Davis,California,33493.0,34163.0,67656,2176.0,13997.0,CA,American Indian and Alaska Native
2883,Los Angeles,California,1958998.0,2012898.0,3971896,85417.0,1485425.0,CA,Black or African-American
2884,Mount Vernon,New York,31876.0,36745.0,68621,2064.0,23777.0,NY,Hispanic or Latino
2885,Lynchburg,Virginia,38614.0,41198.0,79812,4322.0,4364.0,VA,White
2886,Stockton,California,150976.0,154674.0,305650,12822.0,79583.0,CA,American Indian and Alaska Native
2887,Southfield,Michigan,31369.0,41808.0,73177,4035.0,4011.0,MI,American Indian and Alaska Native
2888,Indianapolis,Indiana,410615.0,437808.0,848423,42186.0,72456.0,IN,White
2889,Somerville,Massachusetts,41028.0,39306.0,80334,2103.0,22292.0,MA,American Indian and Alaska Native
2890,Coral Springs,Florida,63316.0,66186.0,129502,4724.0,38552.0,FL,White

#### Dropping missing values and duplicate data

In [211]:
# immigration data
fact_immigration.dropna(subset=['cic_id'])
dim_immigration_personal.dropna(subset=['cic_id'])
dim_immigration_air.dropna(subset=['cic_id'])

fact_immigration.drop_duplicates(subset = 'cic_id', keep = 'first')
dim_immigration_personal.drop_duplicates(subset = 'cic_id', keep = 'first')
dim_immigration_air.drop_duplicates(subset = 'cic_id', keep = 'first')

# temperature data
df_temp_us.dropna()
df_temp_us.drop_duplicates(subset = 'dt', keep = 'first')

# demography data
df_demo_info.dropna()
df_demo_stat.dropna()
df_demo_info.drop_duplicates(subset = 'city', keep = 'first', inplace=True)
df_demo_stat.drop_duplicates(subset = 'city', keep = 'first', inplace=True)

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:17: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:18: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

### Step 3: Define the Data Model
#### 3.1 Conceptual Data Model
<img width="802" alt="Screen Shot 2021-09-09 at 10 46 07 PM" src="https://user-images.githubusercontent.com/79597984/132707777-a124e5d3-03d0-45c6-9bd5-61a8fc6f5618.png">

#### 3.2 Mapping Out Data Pipelines
List the steps necessary to pipeline the data into the chosen data model
1. Create the data model by copying the drop and create statements from `create_tables.sql` file into the query editor in redshift.
2. Run step 1 & 2 above to clean the data.
3. Insert the data into the tables created by running the below code in step `4.1`.

### Step 4: Run Pipelines to Model the Data 
#### 4.1 Create the data model
Build the data pipelines to create the data model.

In [212]:
# Write code here
conn = psycopg2.connect("host=redshift-cluster-1.********.us-west-2.redshift.amazonaws.com dbname=dev user=awsuser password=******* port=5439")
cur = conn.cursor()
conn.autocommit = True

In [213]:
for index, row in fact_immigration.iterrows():
    cur.execute(insert_fact, list(row.values))

In [214]:
for index, row in dim_immigration_personal.iterrows():
    cur.execute(insert_dim_imm_per, list(row.values))

In [215]:
for index, row in dim_immigration_air.iterrows():
    cur.execute(insert_dim_imm_air, list(row.values))

In [216]:
for index, row in df_demo_info.iterrows():
    cur.execute(insert_dim_demo_info, list(row.values))

In [217]:
for index, row in df_demo_stat.iterrows():
    cur.execute(insert_dim_demo_stat, list(row.values))

In [218]:
for index, row in df_temp_us.iterrows():
    cur.execute(insert_dim_temp, list(row.values))

#### 4.2 Data Quality Checks
Explain the data quality checks you'll perform to ensure the pipeline ran as expected. These could include:
 * Integrity constraints on the relational database (e.g., unique key, data type, etc.)
 * Unit tests for the scripts to ensure they are doing the right thing
 * Source/Count checks to ensure completeness
 
Run Quality Checks

#### Checking if the duplicated rows are all removed

In [219]:
duplicate_query = """
    SELECT cic_id, COUNT(cic_id)
    FROM fact_immigration
    GROUP BY cic_id
    HAVING COUNT(cic_id)>1;
"""
cur.execute(duplicate_query)
data = cur.fetchall()

if not data:
    print("There's no duplicated rows")
else:
    print(f"There's {len(data)} duplicated rows in cic_id in the table fact_immigration")

[]
There's no duplicated rows

In [220]:
duplicate_query = """
    SELECT cic_id, COUNT(cic_id)
    FROM dim_immigration_personal
    GROUP BY cic_id
    HAVING COUNT(cic_id)>1;
"""
cur.execute(duplicate_query)
data = cur.fetchall()

if not data:
    print("There's no duplicated rows")
else:
    print(f"There's {len(data)} duplicated rows in cic_id in the table dim_immigration_personal")

[]
There's no duplicated rows

In [221]:
duplicate_query = """
    SELECT cic_id, COUNT(cic_id)
    FROM dim_immigration_air
    GROUP BY cic_id
    HAVING COUNT(cic_id)>1;
"""
cur.execute(duplicate_query)
data = cur.fetchall()

if not data:
    print("There's no duplicated rows")
else:
    print(f"There's {len(data)} duplicated rows in cic_id in the table dim_immigration_air")

[]
There's no duplicated rows

In [222]:
duplicate_query = """
    SELECT city, COUNT(city)
    FROM dim_demo_info
    GROUP BY city
    HAVING COUNT(city)>1;
"""
cur.execute(duplicate_query)
data = cur.fetchall()

if not data:
    print("There's no duplicated rows")
else:
    print(f"There's {len(data)} duplicated rows in city in the table dim_demo_info")

[]
There's no duplicated rows

In [223]:
duplicate_query = """
    SELECT city, COUNT(city)
    FROM dim_demo_stat
    GROUP BY city
    HAVING COUNT(city)>1;
"""
cur.execute(duplicate_query)
data = cur.fetchall()

if not data:
    print("There's no duplicated rows")
else:
    print(f"There's {len(data)} duplicated rows in city in the table dim_demo_stat")

[]
There's no duplicated rows

In [224]:
duplicate_query = """
    SELECT dt, COUNT(dt)
    FROM dim_temp
    GROUP BY dt
    HAVING COUNT(dt)>1;
"""
cur.execute(duplicate_query)
data = cur.fetchall()

if not data:
    print("There's no duplicated rows")
else:
    print(f"There's {len(data)} duplicated rows in dt in the table dim_temp")

[]
There's no duplicated rows

#### Checking if the rows exist after inserting data

In [225]:
query = "SELECT COUNT(*) FROM fact_immigration;"
cur.execute(query) 
data = cur.fetchall()

if data[0][0] < 1:
    print("No data found in table fact_immigration")
else:
    print(f"Successfully executed with {data[0][0]} records in the table fact_immigration!")

[(2000,)]
Successfully executed with 2000 records in the table fact_immigration!

In [226]:
query = "SELECT COUNT(*) FROM dim_immigration_personal;"
cur.execute(query) 
data = cur.fetchall()
print(data)

if data[0][0] < 1:
    print("No data found in table dim_immigration_personal")
else:
    print(f"Successfully executed with {data[0][0]} records in the table dim_immigration_personal!")

[(2000,)]
Successfully executed with 2000 records in the table dim_immigration_personal!!

In [227]:
query = "SELECT COUNT(*) FROM dim_immigration_air;"
cur.execute(query) 
data = cur.fetchall()

if data[0][0] < 1:
    print("No data found in table dim_immigration_air")
else:
    print(f"Successfully executed with {data[0][0]} records in the table dim_immigration_air!")

[(2000,)]
Successfully executed with 2000 records in the table dim_immigration_air!!

In [228]:
query = "SELECT COUNT(*) FROM dim_demo_info;"
cur.execute(query) 
data = cur.fetchall()

if data[0][0] < 1:
    print("No data found in table dim_demo_info")
else:
    print(f"Successfully executed with {data[0][0]} records in the table dim_demo_info!")

[(567,)]
Successfully executed with 567 records in the table dim_demo_info!!

In [229]:
query = "SELECT COUNT(*) FROM dim_demo_stat;"
cur.execute(query) 
data = cur.fetchall()

if data[0][0] < 1:
    print("No data found in table dim_demo_stat")
else:
    print(f"Successfully executed with {data[0][0]} records in the table dim_demo_stat!")

[(567,)]
Successfully executed with 567 records in the table dim_demo_stat!!

In [230]:
query = "SELECT COUNT(*) FROM dim_temp;"
cur.execute(query) 
data = cur.fetchall()

if data[0][0] < 1:
    print("No data found in table dim_temp")
else:
    print(f"Successfully executed with {data[0][0]} records in the table dim_temp!")

[(2000,)]
Successfully executed with 2000 records in the table dim_temp!!

#### 4.3 Data dictionary 
Sources:
- Immigration dataset : [US NTTO website](https://travel.trade.gov/research/reports/i94/historical/2016.html)
- Temperature dataset : [Kaggle](https://www.kaggle.com/berkeleyearth/climate-change-earth-surface-temperature-data)
- Demographic dataset : [OpenSoft](https://public.opendatasoft.com/explore/dataset/us-cities-demographics/export/)

__Fact Table__
- fact_immigration<br>
`cic_id` : city id<br>
`year` : year the object came in<br>
`month` : month the object came in<br>
`dep_city` : departing city<br>
`arrival_date` : arrival date in the US<br>
`dep_date` : departure date from the US<br>
`travel_code` : travel code<br>
`visa` : visa codes in 3 categories<br>

__Dimension Tables__
- dim_immigration_personal<br>
`cic_id` : city id<br>
`citizen_country` : the city the object is citizen in<br>
`resident_country` : residing city<br>
`birthyear` : birthyear in 4 digits<br>
`gender` : gender<br>
`ins_number` : INS number<br>
<br>
- dim_immigration_air<br>
`cic_id` : city id<br>
`airline` : airline used to arrive in the US<br>
`admin_number` : admission number<br>
`flight_number` : flight number of Airline used to arrive in the US<br>
`visa` : visa codes in 3 categories<br>
`visa_type` : class of admission legally admitting the non-immigrant to temporarily stay in the US<br>
<br>
- dim_temp<br>
`dt` : date<br>
`avg_temp` : average temperature<br>
`avg_temp_uncertainty` : average tempertaure uncertainty<br>
`city` : city <br>
`country` : country<br>
`latitude` : latitude<br>
`longitude` : longitude<br>
<br>
- dim_demo_info<br>
`city` : city in the US<br>
`state` : state in the US<br>
`m_population` : male population of the city<br>
`f_population` : female population of the city<br>
`total_population` : total population of the city<br>
`num_of_veterans` : number of veterans in the city<br>
`foreign_born` : number of foreign-borns in. the city <br>
`state_code` : state code<br>
`race` : race of the object<br>
<br>
- dim_demo_stat<br>
`city` : city in the US<br>
`state` : state in the US<br>
`median_age` : median age of the population in the city<br>
`avg_household_size` : average household size of the population of the city<br> 
`state_code` : state code<br>

#### Step 5: Complete Project Write Up

##### Steps taken in the project
1. Load the data using Pandas DataFrame and then process them
2. Clean the processed data frames
    - Remove the rows with unmatching data types
    - Remove empty rows
    - Remove duplicates
    - Convert the column to a better data type
3. Create the tables using SQL and Redshift, and also create the schema
4. Connect to Redshift cluster and insert the data we prepared in step 1 & 2
5. Go through Data qulity check in order to see if the tables were made in the way we wanted
    - Check if there's any duplicated data
    - Check if any of the rows are empty

##### Purpose of the output model
The output data model will be used for further analysis of the information we obtained from the above steps. For example, we would be able to find out the relationship between the temperature and the population of the city in the US.

##### Choice of tools
1. Pandas DataFrame to process and clean the data before inserting.
2. Spark(PySpark) to insert the data into the schema created with SQL.

##### How often the data should be updated and why
The immigration data should be updated monthly since it's in a monthly form, and the temperature data should be updated annually.

##### Write a description of how you would approach the problem differently under the following scenarios:
 * The data was increased by 100x.
 - Using `Spark` along with `EMR(Hadoop)` should help me process the data in much bigger size. This way, I would be able to handle the copy of the data on cloud.
 
 * The data populates a dashboard that must be updated on a daily basis by 7am every day.
 - For the automated system like this situation, `Apache Airflow` would be the best choice since we can schedule the ETL process within Airflow. With this powerful automation tool, we can also send out emails to other teams in charge when there's an error in the task.
 
 * The database needed to be accessed by 100+ people.
 - `AWS Redshift` will allow us to have out database accessed by a number of people in a stable manner.